In [34]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [64]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns = ['W','X','Y','Z'],
                   index=['Dog','Cat','Bird','Mouse'])

animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [65]:
animals.iloc[[1,1],[0,2]] = np.nan

animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [66]:
behaviour_map = {'W':'good', 'X':'bad','Y':'good', 'Z':'bad'}

In [67]:
animal_col = animals.groupby(behaviour_map, axis=1)

animal_col.mean()

        bad  good
Dog     2.0   1.0
Cat     6.0   NaN
Bird   10.0   9.0
Mouse  14.0  13.0

In [68]:
behav_series = Series(behaviour_map)

behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [69]:
animals.groupby(behav_series, axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [70]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [71]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [72]:
keys = ['A','B','A','B']

In [73]:
animals.groupby([len,keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [76]:
hier_col = pd.MultiIndex.from_arrays([['London','Lahore','New York','Abu Dahbi','Dublin'], [1,2,3,1,2]], names=['city','sub_values'])

In [77]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5), columns= hier_col)

In [78]:
dframe_hr = dframe_hr * 100

In [80]:
dframe_hr

city       London Lahore New York Abu Dahbi Dublin
sub_values      1      2        3         1      2
0               0    100      200       300    400
1             500    600      700       800    900
2            1000   1100     1200      1300   1400
3            1500   1600     1700      1800   1900
4            2000   2100     2200      2300   2400